app/views/upload_csvs/index.html.erb

SELECT `csvs`.* FROM `csvs` WHERE `csvs`.`upload_csv_id` = 1 LIMIT 1
---
                <td>
                  <% if Csv.find_by_upload_csv_id(upload_csv.id)!=nil %>