app/controllers/apisettings_controller.rb

SELECT `apisettings`.* FROM `apisettings` LIMIT 1
SELECT `smtp_settings`.* FROM `smtp_settings` LIMIT 1
SELECT `key_mandrills`.* FROM `key_mandrills` LIMIT 1
SELECT `mandrill_settings`.* FROM `mandrill_settings` LIMIT 1
---
  def new
   if current_user && current_user.user_type=="admin"
      @apisetting = Apisetting.first
      if @apisetting.blank?
         @apisetting = Apisetting.new
         @key_mandrill = KeyMandrill.first
         if !@key_mandrill.present?
           @key_mandrill = KeyMandrill.new
         else
           m = Mandrill::API.new(@key_mandrill.key)
           if defined?(m.templates.list.class)
             result = m.templates.list
             @list_template = []
             result.each_with_index do |template,index|
               @list_template << template["name"]
             end
           end
         end
         @smtp_setting = SmtpSetting.first
         if !@smtp_setting.present?
           @smtp_setting = SmtpSetting.new
         end
         @mandrill_setting = MandrillSetting.first

UPDATE `apisettings` SET `api_key` = '374e4dc45917b1a48525c8131f276a9d-us6', `list` = NULL, `updated_at` = '2013-09-12 11:38:42' WHERE `apisettings`.`id` = 1
---
          puts"========================params===================================="
          @listloaded = params[:listloaded]
          @api_key = params[:api_key]
          @apisetting.update_attributes(:api_key => @api_key, :list=>nil)

SELECT `apisettings`.* FROM `apisettings` LIMIT 1
INSERT INTO `apisettings` (`api_key`, `created_at`, `list`, `updated_at`) VALUES ('374e4dc45917b1a48525c8131f276a9d-us6', '2013-09-09 17:05:54', 'd6100e31db', '2013-09-09 17:05:54')
---
  def create
    if params[:apisetting][:api_key].present?
      @api_key = params[:apisetting][:api_key]
      gb = Gibbon::API.new(@api_key)
      Gibbon::API.api_key = @api_key
      Gibbon::API.timeout = 15
      Gibbon::API.throws_exceptions = false

      # ------------load lists--------------

      @lists = Gibbon::API.lists.list
      if @lists["status"] != "error"
              @apisetting = Apisetting.first
              if @apisetting.present?
                @apisetting.update_attributes!(params[:apisetting])
                redirect_to new_apisetting_path, :notice=>"Mandrill Api Key Successfully Created."
              else
                @apisetting = Apisetting.new(params[:apisetting])
                @apisetting.save!

SELECT `apisettings`.* FROM `apisettings` WHERE `apisettings`.`id` = 1 LIMIT 1
SELECT `key_mandrills`.* FROM `key_mandrills` LIMIT 1
SELECT `smtp_settings`.* FROM `smtp_settings` LIMIT 1
SELECT `mandrill_settings`.* FROM `mandrill_settings` LIMIT 1
---
    def edit
     if current_user && current_user.user_type=="admin"
          @apisetting = Apisetting.find(params[:id])
          @api_key = @apisetting.api_key
          @list = @apisetting.list
          @key_mandrill = KeyMandrill.first
          if !@key_mandrill.present?
            @key_mandrill = KeyMandrill.new
          end

          @smtp_setting = SmtpSetting.first
          if !@smtp_setting.present?
            @smtp_setting = SmtpSetting.new
          end

          @mandrill_setting = MandrillSetting.first

SELECT `apisettings`.* FROM `apisettings` WHERE `apisettings`.`id` = 1 LIMIT 1
UPDATE `apisettings` SET `api_key` = '63713f59c1fb39cfb4e58665cf1c381c-us6', `list` = 'bc3804fc1c', `updated_at` = '2013-09-12 11:28:41' WHERE `apisettings`.`id` = 1
---
  def update
    @apisetting = Apisetting.find(params[:id])
    if @apisetting.update_attributes(params[:apisetting])

SELECT `key_mandrills`.* FROM `key_mandrills` LIMIT 1
UPDATE `key_mandrills` SET `key` = 'kS6GicA7hGM7ZiL7ALa2DQ', `updated_at` = '2013-09-11 18:05:01' WHERE `key_mandrills`.`id` = 1
---
  def load_template
    if current_user && current_user.user_type=="admin"

       @key = params[:key]
      # ------------load lists--------------
      if @key.present?

        #m = Mandrill::API.new 'OCnumMSfJOSYVTFonjBOoQ'
        m = Mandrill::API.new(@key)
        #@key = 'OCnumMSfJOSYVTFonjBOoQ'
        if defined?(m.templates.list.class)
          @mandrill_key = KeyMandrill.first
          @mandrill_key.key = @key
          @mandrill_key.save!