app/controllers/csvs_controller.rb

SELECT `apisettings`.* FROM `apisettings` LIMIT 1
---
def new
  if current_user && current_user.user_type=="admin"
     @csv = Csv.new
     @apisetting = Apisetting.first

SELECT `csvs`.* FROM `csvs` WHERE `csvs`.`upload_csv_id` = 3 LIMIT 1
SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`id` IS NULL LIMIT 1
INSERT INTO `csvs` (`created_at`, `csv`, `csv_url`, `list_id`, `tem`, `updated_at`, `upload_csv_id`) VALUES ('2013-09-11 18:04:15', 'Ahmar_Akram.pdf', '/uploads/tmp/1378922655-22045-4644/Ahmar_Akram.pdf', NULL, NULL, '2013-09-11 18:04:15', 2)
---
  def create
    if current_user && current_user.user_type == "admin"
       if params[:csv][:csv].present?
            @upload_csv = UploadCsv.find_by_id(params[:csv][:upload_csv_id])
            @csv = @upload_csv.csv || Csv.new
            @csv.csv = params[:csv][:csv]
            @csv.upload_csv = @upload_csv
            @csv.csv_url = @csv.csv.url
            if @csv.save

SELECT `csvs`.* FROM `csvs` WHERE `csvs`.`id` = 2 LIMIT 1
UPDATE `upload_csvs` SET `follow_up` = 'N', `clicked_link_date` = '09-12-2013', `updated_at` = '2013-09-12 12:48:46' WHERE `upload_csvs`.`id` = 2
---
  def show
    @csv = Csv.find_by_id(params[:id])
    if @csv.present?
      @date = DateTime.now.to_date
      @date = @date.strftime("%m-%d-%Y")
      @csv.upload_csv.update_attributes(:follow_up => "N", :clicked_link_date=>@date)

SELECT `csvs`.* FROM `csvs` WHERE `csvs`.`id` = 1 LIMIT 1
UPDATE `upload_csvs` SET `approved` = 'N', `approved_date` = '09-12-2013', `updated_at` = '2013-09-12 08:10:23' WHERE `upload_csvs`.`id` = 2
---
  def approved
    puts"========================== Approved ===================================="
    @csv = Csv.find_by_id(params[:id])
    if @csv.present?
      @date = DateTime.now.to_date
      @date = @date.strftime("%m-%d-%Y")
      @approved = params[:approved]
      if  @approved == '1'
        @csv.upload_csv.update_attributes(:approved => "Y", :approved_date => @date)