app/controllers/key_mandrills_controller.rb

  def create
    if params[:key_mandrill][:key].present?
      @key = params[:key_mandrill][:key]
      @key_mandrill = KeyMandrill.new(params[:key_mandrill])

      m = Mandrill::API.new(@key)

      #@key = 'OCnumMSfJOSYVTFonjBOoQ'
      if defined?(m.templates.list.class)
        @key_mandrill.save!
---
INSERT INTO `key_mandrills` (`created_at`, `key`, `list`, `template_name`, `updated_at`) VALUES ('2013-09-09 17:06:05', 'OCnumMSfJOSYVTFonjBOoQ', NULL, NULL, '2013-09-09 17:06:05')

  def update
    @key_mandrill = KeyMandrill.find(params[:id])
    @key_mandrill.update_attributes(params[:key_mandrill])
---
SELECT `key_mandrills`.* FROM `key_mandrills` WHERE `key_mandrills`.`id` = 1 LIMIT 1
UPDATE `key_mandrills` SET `template_name` = 'Issue Notification From Align Technology', `updated_at` = '2013-09-11 18:15:32' WHERE `key_mandrills`.`id` = 1