app/controllers/mandrill_settings_controller.rb

INSERT INTO `mandrill_settings` (`created_at`, `email`, `subject`, `updated_at`, `user_name`) VALUES ('2013-09-09 17:16:36', 'zaeem@chimpchamp.com', 'Hello', '2013-09-09 17:16:36', 'asasasa')
---
  def create

    @mandrill_setting = MandrillSetting.new(params[:mandrill_setting])
    if @mandrill_setting.save

SELECT `mandrill_settings`.* FROM `mandrill_settings` WHERE `mandrill_settings`.`id` = 1 LIMIT 1
UPDATE `mandrill_settings` SET `subject` = 'Hello!', `updated_at` = '2013-09-12 15:12:49' WHERE `mandrill_settings`.`id` = 1
---
  def update
    @mandrill_setting = MandrillSetting.find(params[:id])
    @mandrill_setting.update_attributes(params[:mandrill_setting])