app/controllers/upload_csvs_controller.rb

SELECT `csvs`.* FROM `csvs` WHERE `csvs`.`upload_csv_id` = 1 LIMIT 1
SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`message_sent` = 0 LIMIT 1
SELECT `upload_csvs`.* FROM `upload_csvs`
SELECT `key_mandrills`.* FROM `key_mandrills` LIMIT 1
---
  def index
   if current_user && current_user.user_type == "admin"
      #@upload_csvs = UploadCsv.all
      @upload_csvs = UploadCsv.where(:message_sent=>0)
      if  @upload_csvs.first.present?
              @key_mandrill = KeyMandrill.first

SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`id` = 3 LIMIT 1
---
  def new
    if current_user && current_user.user_type == "admin"
      @csv = Csv.new
      @upload_csv= UploadCsv.find_by_id(params[:upload_csv_id])

SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`id` = 4 LIMIT 1
DELETE FROM `upload_csvs` WHERE `upload_csvs`.`id` = 4
---
  def destroy
    @action = UploadCsv.find(params[:id])
    @action.destroy

SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`id` = 3 LIMIT 1
---
  def edit
    @action = UploadCsv.find(params[:id])

SELECT `upload_csvs`.* FROM `upload_csvs` WHERE `upload_csvs`.`id` = 3 LIMIT 1
UPDATE `upload_csvs` SET `pdf_url` = '', `last_message_name` = '', `last_send_date` = '', `remove_date` = '', `remove_user` = '', `email` = 'faisal.bhatti@devsinc.com', `updated_at` = '2013-09-13 14:33:47' WHERE `upload_csvs`.`id` = 3
---
  def update
    @action = UploadCsv.find(params[:id])
    if @action.update_attributes(params[:upload_csv])

SELECT `key_mandrills`.* FROM `key_mandrills` LIMIT 1
---
  def send_email
    if current_user && current_user.user_type == "admin"

      @list_name = params[:key] || ""
      if @list_name.present?
        @key = KeyMandrill.first

SELECT `mandrill_settings`.* FROM `mandrill_settings` LIMIT 1
---
                                                              {:name => "accepttracking", :content => email_html1},
                                                              {:name => "canceltracking", :content => email_html0},
                                                            ]
              @mandrill_setting = MandrillSetting.first

UPDATE `upload_csvs` SET `message_sent` = 1, `last_send_date` = '09-11-13', `last_message_name` = 'Issue Notification From Align Technology', `updated_at` = '2013-09-11 18:05:41' WHERE `upload_csvs`.`id` = 2
---

              if sending[0]["status"] == "sent"
                #@upload_csv.update_attributes(:message_sent => @upload_csv.message_sent+1, :last_send_date => Time.now.strftime("%m-%d-%y"), :last_message_name=> @list_name)
                @upload_csv.update_attributes(:message_sent => @upload_csv.message_sent+1, :last_send_date => Time.now.strftime("%m-%d-%y"), :last_message_name=> @list_name)