app/controllers/users_controller.rb

  def index
    #authorize! :index, @user, :message => 'Not authorized as an administrator.'
    if current_user.blank?
      redirect_to new_user_session_path
    end
    @users = User.all
---
SELECT `users`.* FROM `users`

  def destroy
    authorize! :destroy, @user, :message => 'Not Authorized as an Administrator.'
    user = User.find(params[:id])
    unless user == current_user
      user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 3

  def create_user
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `updated_at`, `user_type`) VALUES ('2013-09-09 17:07:07', NULL, NULL, 'zaeem1@chimpchamp.com', '$2a$10$tO/KYtJaH84wpYRNSp9g6Oj1aY6HBIO5Cc2MUPvQZ7L6VHKtYSJPe', NULL, NULL, 'admin', NULL, NULL, NULL, 0, '2013-09-09 17:07:07', NULL)